Revit 2027 API
BuiltInFailures.FamilyFailures.ColumnHeightZeroBecauseOfInvalidOffset Property
 Change Offset Value so that Column height is not 0.0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnHeightZeroBecauseOfInvalidOffset { get; }
Public Shared ReadOnly Property ColumnHeightZeroBecauseOfInvalidOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnHeightZeroBecauseOfInvalidOffset {
	FailureDefinitionId^ get ();
}
static member ColumnHeightZeroBecauseOfInvalidOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace